Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: [0175] The solution 1 may be used to resolve a problem existing when the manner 1 is used to generate the message authentication code in step 301.
de_de: [0175] Die Lösung 1 kann verwendet werden, um ein Problem zu lösen, das vorliegt, wenn die Weise 1 verwendet wird, um den Nachrichtenauthentifizierungscode in Schritt 301 zu erzeugen.

source: [0176] FIG. 4 is a flowchart of a connection resume request method according to this application, and the method includes the following steps.
de_de: [0176] FIG. 4 ist ein Flussdiagramm eines Verbindungswiederaufnahmeanforderungsverfahrens gemäß dieser Anmeldung, und das Verfahren umfasst die folgenden Schritte.

source: [0177] Step 401: A terminal generates a message authentication code based on a freshness parameter and an integrity protection key that is of the terminal.
de_de: [0177] Schritt 401: Ein Endgerät erzeugt einen Nachrichtenauthentifizierungscode basierend auf einem Aktualitätsparameter und einem Integritätsschutzschlüssel, der von dem Endgerät stammt.

source: [0178] Freshness parameters used to generate message authentication codes at two consecutive times are different.
de_de: [0178] Aktualitätsparameter, die zum Erzeugen von Nachrichtenauthentifizierungscodes zu zwei aufeinanderfolgenden Zeitpunkten verwendet werden, sind unterschiedlich.

source: That is, a specific value of the freshness parameter changes each time the message authentication code is generated.
de_de: Das heißt, ein spezifischer Wert des Aktualitätsparameters ändert sich jedes Mal, wenn der Nachrichtenauthentifizierungscode erzeugt wird.

source: Consequently, a freshness parameter used when a message authentication code is currently generated is different from a freshness parameter used when a message authentication code is generated at a previous time.
de_de: Folglich unterscheidet sich ein Aktualitätsparameter, der verwendet wird, wenn ein Nachrichtenauthentifizierungscode aktuell erzeugt wird, von einem Aktualitätsparameter, der verwendet wird, wenn ein Nachrichtenauthentifizierungscode zu einem vorherigen Zeitpunkt erzeugt wird.

source: [0179] In an implementation, the freshness parameter includes a packet data convergence protocol count (Packet Data Convergence Protocol COUNT, PDCP count), and the PDCP count may include an uplink PDCP count and a downlink PDCP count.
de_de: [0179] In einer Implementierung enthält der Aktualitätsparameter eine Paketdatenkonvergenzprotokoll-Zählung (Packet Data Convergence Protocol COUNT, PDCP-Zählung), und die PDCP-Zählung kann eine Uplink-PDCP-Zählung und eine Downlink-PDCP-Zählung enthalten.

source: The uplink PDCP count is increased by 1 each time the terminal sends an uplink PDCP data packet, and the downlink PDCP count is increased by 1 each time a base station sends a downlink PDCP data packet.
de_de: Die Uplink-PDCP-Zählung wird jedes Mal um 1 erhöht, wenn das Endgerät ein Uplink-PDCP-Datenpaket sendet, und die Uplink-PDCP-Zählung wird jedes Mal um 1 erhöht, wenn eine Basisstation ein Downlink-PDCP-Datenpaket sendet.

source: For example, the PDCP count may be an uplink PDCP count of a signaling radio bearer (signaling radio bearer, SRB).
de_de: Zum Beispiel kann die PDCP-Zählung eine Uplink-PDCP-Zählung eines Signalisierungsfunkträgers (Signalisierungsfunkträger, SRB) sein.

source: Optionally, the PDCP count may be reset to zero each time a radio bearer is re-established.
de_de: Optional kann die PDCP-Zählung jedes Mal, wenn ein Funkträger wiederhergestellt wird, auf null zurückgesetzt werden.

source: Because the PDCP count keeps changing, the message authentication code generated by the terminal each time is different from the message authentication code that is generated at a previous time.
de_de: Da sich die PDCP-Zählung weiter ändert, unterscheidet sich der durch das Endgerät jedes Mal erzeugte Nachrichtenauthentifizierungscode von dem Nachrichtenauthentifizierungscode, der zu einem vorherigen Zeitpunkt erzeugt wurde.

source: [0180] In another implementation, the freshness parameter may include a quantity of rejection times, and the quantity of rejection times may be used to indicate a quantity of times for which resuming of the RRC connection that the terminal attempts to perform is rejected by a network side.
de_de: [0180] In einer anderen Implementierung kann der Aktualitätsparameter eine Anzahl von Ablehnungszeiten enthalten, und die Anzahl von Ablehnungszeiten kann verwendet werden, um eine Menge von Zeiten anzugeben, für die die Wiederaufnahme der RRC-Verbindung, die das Endgerät durchzuführen versucht, durch eine Netzwerkseite abgelehnt wird.

source: The quantity of rejection times is increased by 1 each time resuming that the terminal attempts to perform is rejected by the network side.
de_de: Die Anzahl von Ablehnungszeiten wird jedes Mal um 1 erhöht, wenn die Wiederaufnahme, die das Endgerät durchzuführen versucht, durch die Netzwerkseite abgelehnt wird.

source: Optionally, the quantity of rejection times may be reset to zero each time the RRC connection is successfully resumed.
de_de: Optional kann die Anzahl von Ablehnungszeiten jedes Mal auf null zurückgesetzt werden, wenn die RRC-Verbindung erfolgreich wiederaufgenommen wird.

source: Because the quantity of rejection times keeps changing, the message authentication code generated by the terminal each time is different from the message authentication code that is generated at a previous time.
de_de: Da sich die Anzahl von Ablehnungszeiten weiter ändert, unterscheidet sich der durch das Endgerät jedes Mal erzeugte Nachrichtenauthentifizierungscode von dem Nachrichtenauthentifizierungscode, der zu einem vorherigen Zeitpunkt erzeugt wurde.

source: [0181] During specific implementation, the message authentication code may be generated based on the freshness parameter, the integrity protection key of the terminal, and the integrity protection algorithm of the terminal.
de_de: [0181] Während einer spezifischen Implementierung kann der Nachrichtenauthentifizierungscode basierend auf dem Aktualitätsparameter, dem Integritätsschutzschlüssel des Endgeräts und dem Integritätsschutzalgorithmus des Endgeräts erzeugt werden.

source: [0182] Step 402: The terminal sends a connection resume request message to a target base station, and the target base station receives the connection resume request message from the terminal.
de_de: [0182] Schritt 402: Das Endgerät sendet eine Verbindungswiederaufnahmeanforderungsnachricht an eine Zielbasisstation, und die Zielbasisstation empfängt die Verbindungswiederaufnahmeanforderungsnachricht von dem Endgerät.

source: [0183] The connection resume request message is used to request to resume the RRC connection, and the connection resume request message includes the message authentication code and a resume identifier.
de_de: [0183] Die Verbindungswiederaufnahmeanforderungsnachricht wird verwendet, um die Wiederaufnahme der RRC-Verbindung anzufordern, und die Verbindungswiederaufnahmeanforderungsnachricht enthält den Nachrichtenauthentifizierungscode und eine Wiederaufnahmekennung.

source: Optionally, the connection resume request message further includes an indication parameter, and the indication parameter is used to indicate the freshness parameter.
de_de: Optional enthält die Verbindungswiederaufnahmeanforderungsnachricht ferner einen Anzeigeparameter, und der Anzeigeparameter wird verwendet, um den Aktualitätsparameter anzugeben.

source: Specifically, the indication parameter may be the freshness parameter, or may be a parameter that may indicate the freshness parameter.
de_de: Insbesondere kann der Anzeigeparameter der Aktualitätsparameter sein oder kann ein Parameter sein, der den Aktualitätsparameter anzeigen kann.

source: The connection resume request message further includes the resume identifier.
de_de: Die Verbindungswiederaufnahmeanforderungsnachricht enthält ferner die Wiederaufnahmekennung.

source: [0184] Specifically, if the freshness parameter is the quantity of rejection times, the connection resume request message includes the message authentication code and the resume identifier.
de_de: [0184] Wenn der Aktualitätsparameter die Anzahl von Ablehnungszeiten ist, enthält die Verbindungswiederaufnahmeanforderungsnachricht insbesondere den Nachrichtenauthentifizierungscode und die Wiederaufnahmekennung.

source: If the freshness parameter is the PDCP count, the connection resume request message includes the message authentication code, the resume identifier, and the indication parameter, and the indication parameter is used to indicate the PDCP count.
de_de: Wenn der Aktualitätsparameter die PDCP-Zählung ist, enthält die Verbindungswiederaufnahmeanforderungsnachricht den Nachrichtenauthentifizierungscode, die Wiederaufnahmekennung und den Anzeigeparameter, und der Anzeigeparameter wird verwendet, um die PDCP-Zählung anzuzeigen.

source: [0185] If the freshness parameter is the PDCP count, and the PDCP count is represented by using a binary bit, the indication parameter is the PDCP count, that is, all bits of the PDCP count.
de_de: [0185] Wenn der Aktualitätsparameter der PDCP-Zählung ist und der PDCP-Zählung unter Verwendung eines binären Bits dargestellt wird, ist der Anzeigeparameter der PDCP-Zählung, d. h. alle Bits der PDCP-Zählung.

source: Alternatively, the indication parameter may be some bits of a PDCP count.
de_de: Alternativ kann der Anzeigeparameter einige Bits einer PDCP-Zählung sein.

source: [0186] For example, it is assumed that the PDCP count is represented by using 32 bits.
de_de: [0186] Zum Beispiel wird angenommen, dass der PDCP-Zählung durch Verwenden von 32 Bits dargestellt wird.

source: Because a change between PDCP counts used when message authentication codes are generated at two consecutive times is not very large, only a low-order bit changes between the PDCP counts used at the two consecutive times, and a high-order bit does not change.
de_de: Da eine Änderung zwischen PDCP-Zählungen, die verwendet werden, wenn Nachrichtenauthentifizierungscodes zu zwei aufeinanderfolgenden Zeitpunkten erzeugt werden, nicht sehr groß ist, ändert sich nur ein Bit niedriger Ordnung zwischen den PDCP-Zählungen, die zu den zwei aufeinanderfolgenden Zeitpunkten verwendet werden, und ein Bit hoher Ordnung ändert sich nicht.

source: Therefore, the indication parameter may be represented by using some low bits of the PDCP count.
de_de: Daher kann der Anzeigeparameter durch Verwenden einiger niedriger Bits der PDCP-Zählung dargestellt werden.

source: For example, a PDCP count used by the terminal to generate the message authentication code at a previous time is "00000000000011111111111100011111", and a PDCP count used by the terminal to generate the message authentication code this time is "00000000000011111111111100100011".
de_de: Zum Beispiel ist eine PDCP-Zählung, die durch das Endgerät verwendet wird, um den Nachrichtenauthentifizierungscode zu einem vorherigen Zeitpunkt zu erzeugen, „00000000000011111111111100011111“, und eine PDCP-Zählung, die durch das Endgerät verwendet wird, um den Nachrichtenauthentifizierungscode zu diesem Zeitpunkt zu erzeugen, ist „00000000000011111111111100100011“.

source: It may be found that only five lower bits of the PDCP count change, but 27 higher bits do not change.
de_de: Es kann festgestellt werden, dass sich nur fünf niedrigere Bits der PDCP-Zählung ändern, sich jedoch 27 höhere Bits nicht ändern.

source: Therefore, N lower bits of the PDCP count may be selected as the indication parameter, where N is greater than 1 and less than 32.
de_de: Daher können N niedrigere Bits der PDCP-Zählung als der Anzeigeparameter ausgewählt werden, wobei N größer als 1 und kleiner als 32 ist.

source: Certainly, the indication parameter may alternatively be all bits of the PDCP count.
de_de: Sicherlich kann der Anzeigeparameter alternativ alle Bits der PDCP-Zählung sein.

source: [0187] If the freshness parameter is the quantity of rejection times, the terminal and the source base station separately maintain a quantity of times for which resuming of the connection that is performed by the terminal is rejected.
de_de: [0187] Wenn der Aktualitätsparameter die Anzahl von Ablehnungszeiten ist, halten das Endgerät und die Quellbasisstation separat eine Anzahl von Zeiten aufrecht, für die das Wiederaufnehmen der Verbindung, das durch das Endgerät durchgeführt wird, abgelehnt wird.

source: [0188] According to step 401 and step 402, the message authentication code generated by the terminal each time is different from the message authentication code that is generated at the previous time.
de_de: [0188] Gemäß Schritt 401 und Schritt 402 unterscheidet sich der Nachrichtenauthentifizierungscode, der durch das Endgerät jedes Mal erzeugt wird, von dem Nachrichtenauthentifizierungscode, der zum vorherigen Mal erzeugt wird.

source: [0189] The following provides subsequent implementation methods of the target base station and the source base station.
de_de: [0189] Das Folgende stellt nachfolgende Implementierungsverfahren der Zielbasisstation und der Quellbasisstation bereit.

source: [0190] Optionally, after step 402, the method further includes the following method steps.
de_de: [0190] Optional umfasst das Verfahren nach Schritt 402 ferner die folgenden Verfahrensschritte.

source: [0191] Step 403: The target base station determines whether to accept the resume request of the terminal.
de_de: [0191] Schritt 403: Die Zielbasisstation bestimmt, ob die Wiederaufnahmeanforderung des Endgeräts akzeptiert werden soll.

source: [0192] The target base station determines, based on a load capability, whether the terminal can access the target base station.
de_de: [0192] Die Zielbasisstation bestimmt basierend auf einer Lastfähigkeit, ob das Endgerät auf die Zielbasisstation zugreifen kann.

source: [0193] In one case, if the target base station has relatively heavy load and cannot be accessed by the terminal, the target base station may reject the resume request of the terminal, that is, reject access by the terminal to the target base station.
de_de: [0193] In einem Fall, wenn die Zielbasisstation eine relativ hohe Last aufweist und auf die das Endgerät nicht zugreifen kann, kann die Zielbasisstation die Wiederaufnahmeanforderung des Endgeräts zurückweisen, das heißt, den Zugriff des Endgeräts auf die Zielbasisstation zurückweisen.

source: In this case, step 404 to step 407 are performed.
de_de: In diesem Fall werden die Schritte 404 bis 407 durchgeführt.

source: [0194] In another case, the target base station does not have very heavy load and may further be accessed by the terminal. In this case, the target base station may accept the resume request of the terminal, that is, agree to access by the terminal to the target base station.
de_de: [0194] In einem anderen Fall weist die Zielbasisstation keine sehr hohe Last auf und es kann ferner durch das Endgerät darauf zugegriffen werden. In diesem Fall kann die Zielbasisstation die Wiederaufnahmeanforderung des Endgeräts akzeptieren, das heißt, dem Zugriff durch das Endgerät auf die Zielbasisstation zustimmen.

source: In this case, step 408 to step 411 are performed.
de_de: In diesem Fall werden die Schritte 408 bis 411 durchgeführt.

source: [0195] Step 404: The target base station sends a notification message to the source base station, and the source base station receives the notification message from the target base station.
de_de: [0195] Schritt 404: Die Zielbasisstation sendet eine Benachrichtigungsnachricht an die Quellbasisstation, und die Quellbasisstation empfängt die Benachrichtigungsnachricht von der Zielbasisstation.

source: [0196] The notification message includes the message authentication code and the resume identifier that are obtained by the target base station from the connection resume request message, and optionally further includes an indication parameter.
de_de: [0196] Die Benachrichtigungsnachricht enthält den Nachrichtenauthentifizierungscode und die Wiederaufnahmekennung, die durch die Zielbasisstation aus der Verbindungswiederaufnahmeanforderungsnachricht erhalten werden, und enthält optional ferner einen Anzeigeparameter.

source: A context of the terminal that is in the source base station and that is instructed to update includes the freshness parameter.
de_de: Ein Kontext des Endgeräts, das sich in der Quellbasisstation befindet und das angewiesen wird, sich zu aktualisieren, enthält den Aktualitätsparameter.

source: [0197] The notification message has one or more of the following functions:
de_de: [0197] Die Benachrichtigungsnachricht weist eine oder mehrere der folgenden Funktionen auf:

source: the notification message is used to notify that the target base station rejects resuming of a connection that is performed by the terminal;
de_de: die Benachrichtigungsnachricht wird verwendet, um zu benachrichtigen, dass die Zielbasisstation die Wiederaufnahme einer Verbindung, die durch das Endgerät durchgeführt wird, ablehnt;

source: the notification message is used to instruct to update the freshness parameter in the context of the terminal in the source base station; and
de_de: die Benachrichtigungsnachricht wird verwendet, um anzuweisen, den Aktualitätsparameter im Kontext des Endgeräts in der Quellbasisstation zu aktualisieren; und

source: [0198] Step 405: The source base station checks the message authentication code, and updates the context of the terminal if checking the message authentication code to be successful.
de_de: [0198] Schritt 405: Die Quellbasisstation prüft den Nachrichtenauthentifizierungscode und aktualisiert den Kontext des Endgeräts, wenn geprüft wird, dass der Nachrichtenauthentifizierungscode erfolgreich ist.

source: [0199] In this step, the source base station first obtains the context of the terminal in the source base station based on the resume identifier in the notification message.
de_de: [0199] In diesem Schritt erhält die Quellbasisstation zuerst den Kontext des Endgeräts in der Quellbasisstation basierend auf der Wiederaufnahmekennung in der Benachrichtigungsnachricht.

source: [0200] Then, the source base station determines the freshness parameter.
de_de: [0200] Dann bestimmt die Quellbasisstation den Aktualitätsparameter.

source: [0201] In an example, the source base station determines the freshness parameter based on the indication parameter.
de_de: [0201] In einem Beispiel bestimmt die Quellbasisstation den Aktualitätsparameter basierend auf dem Anzeigeparameter.

source: For example, when the freshness parameter is the PDCP count, the source base station determines, based on the indication parameter, the PDCP count indicated by the indication parameter.
de_de: Wenn der Aktualitätsparameter beispielsweise die PDCP-Zählung ist, bestimmt die Quellbasisstation basierend auf dem Anzeigeparameter die PDCP-Zählung, die durch den Anzeigeparameter angezeigt wird.

source: During specific implementation, if the indication parameter indicates some bits of a PDCP count, the source base station may determine, based on some high bits of a PDCP count that is currently stored in the source base station and some low bits of the PDCP count that are indicated by the indication parameter, the PDCP count indicated by the indication parameter.
de_de: Wenn der Anzeigeparameter während einer spezifischen Implementierung einige Bits einer PDCP-Zählung anzeigt, kann die Quellbasisstation basierend auf einigen hohen Bits einer PDCP-Zählung, die aktuell in der Quellbasisstation gespeichert ist, und einigen niedrigen Bits der PDCP-Zählung, die durch den Anzeigeparameter angezeigt werden, die PDCP-Zählung bestimmen, die durch den Anzeigeparameter angezeigt wird.

source: [0202] In another example, the source base station directly determines the freshness parameter.
de_de: [0202] In einem anderen Beispiel bestimmt die Quellbasisstation direkt den Aktualitätsparameter.

source: For example, when the freshness parameter is the quantity of rejection times, the source base station determines a current quantity of rejection times as the quantity of rejection times.
de_de: Wenn der Aktualitätsparameter zum Beispiel die Anzahl von Ablehnungszeiten ist, bestimmt die Quellbasisstation eine aktuelle Anzahl von Ablehnungszeiten als die Anzahl von Ablehnungszeiten.

source: That is, the target base station may directly obtain the quantity of rejections of the terminal locally.
de_de: Das heißt, die Zielbasisstation kann die Anzahl von Ablehnungen des Endgeräts lokal direkt erhalten.

source: [0203] Then, the source base station generates the message authentication code based on the freshness parameter, the integrity protection key of the source base station, and the integrity protection algorithm of the source base station.
de_de: [0203] Dann erzeugt die Quellbasisstation den Nachrichtenauthentifizierungscode basierend auf dem Aktualitätsparameter, dem Integritätsschutzschlüssel der Quellbasisstation und dem Integritätsschutzalgorithmus der Quellbasisstation.

source: If the generated message authentication code is the same as a message authentication code that is generated by the terminal and that is carried in the notification message, the check is successful, or if the generated message authentication code is different from the message authentication code that is generated by the terminal and that is carried in the notification message, the check is failed.
de_de: Wenn der erzeugte Nachrichtenauthentifizierungscode der gleiche wie ein Nachrichtenauthentifizierungscode ist, der durch das Endgerät erzeugt wird und der in der Benachrichtigungsnachricht geführt wird, ist die Prüfung erfolgreich, oder wenn sich der erzeugte Nachrichtenauthentifizierungscode von dem Nachrichtenauthentifizierungscode unterscheidet, der durch das Endgerät erzeugt wird und der in der Benachrichtigungsnachricht geführt wird, ist die Prüfung fehlgeschlagen.

source: [0204] Optionally, the source base station may generate the message authentication code based on the freshness parameter, the integrity protection key of the source base station, the integrity protection algorithm of the source base station, a source PCI, a source cell radio network temporary identifier (cell radio network temporary identifier, C-RNTI), a target cell identifier, and a resume constant.
de_de: [0204] Optional kann die Quellbasisstation den Nachrichtenauthentifizierungscode basierend auf dem Aktualitätsparameter, dem Integritätsschutzschlüssel der Quellbasisstation, dem Integritätsschutzalgorithmus der Quellbasisstation, einer Quell-PCI, einer temporären Quell-Zellenfunknetzkennung (temporären Zellenfunknetzkennung, C-RNTI), einer Zielzellenkennung und einer Wiederaufnahmekonstante erzeugen.

source: [0205] The source base station updates the freshness parameter in the context of the terminal if checking the message authentication code to be successful.
de_de: [0205] Die Quellbasisstation aktualisiert den Aktualitätsparameter im Kontext des Endgeräts, wenn sie prüft, dass der Nachrichtenauthentifizierungscode erfolgreich ist.
